//
//  Major.swift
//  FollowSSU
//
//  Created by 최은성 on 2022/10/14.
//

import Foundation

struct Major {
    var allMajors: [String] = [
        "기독교학과",
        "영어영문학과",
        "불어불문학과",
        "일어일문학과",
        "사학과",
        "스포츠학부",
        "국어국문학과",
        "독어독문학과",
        "중어중문학과",
        "철학과",
        "예술창작학부",
        "수학과",
        "화학과",
        "의생명시스템학부",
        "물리학과",
        "정보통계보험수리학과",
        "법학과",
        "국제법무학과",
        "사회복지학부",
        "정치외교학과",
        "언론홍보학과",
        "행정학부",
        "정보사회학과",
        "평생교육학과",
        "경제학과",
        "금융경제학과",
        "통상산업학과",
        "글로벌통상학과",
        "국제무역학과",
        "경영학부",
        "회계학과",
        "벤처경영학과",
        "복지경영학과",
        "벤처중소기업학과",
        "금융학부",
        "혁신경영학과",
        "회계세무학과",
        "화학공학과",
        "전기공학부",
        "건축학부",
        "산업정보시스템공학과",
        "기계공학부",
        "유기신소재파이버공학과",
        "컴퓨터학부",
        "글로벌미디어학부",
        "스마트시스템소프트웨어학과",
        "IT융합전공",
        "전자정보공학부",
        "소프트웨어학부",
        "미디어경영학과",
        "융합특성화자유전공학부"
    ]
}
